tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1906_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1906_H_
#define _PIC16LF1906_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TXIF                          66
#define RCIF                          67
#define ADIF                          68
#define TMR1GIF                       69
#define PIR2                          70
#define LCDIF                         71
#define TMR0                          72
#define TMR1L                         73
#define TMR1H                         74
#define T1CON                         75
#define TMR1ON                        76
#define nT1SYNC                       77
#define T1OSCEN                       78
#define T1CKPS0                       79
#define T1CKPS                        80
#define T1CKPS1                       81
#define TMR1CS                        82
#define TMR1CS0                       83
#define TMR1CS1                       84
#define T1GCON                        85
#define T1GSS0                        86
#define T1GSS                         87
#define T1GSS1                        88
#define T1GVAL                        89
#define T1GGO_nDONE                   90
#define T1GGO                         91
#define T1GSPM                        92
#define T1GTM                         93
#define T1GPOL                        94
#define TMR1GE                        95
#define TRISA                         96
#define TRISA0                        97
#define TRISA1                        98
#define TRISA2                        99
#define TRISA3                        100
#define TRISA4                        101
#define TRISA5                        102
#define TRISA6                        103
#define TRISA7                        104
#define TRISB                         105
#define TRISB0                        106
#define TRISB1                        107
#define TRISB2                        108
#define TRISB3                        109
#define TRISB4                        110
#define TRISB5                        111
#define TRISB6                        112
#define TRISB7                        113
#define TRISC                         114
#define TRISC0                        115
#define TRISC1                        116
#define TRISC2                        117
#define TRISC3                        118
#define TRISC4                        119
#define TRISC5                        120
#define TRISC6                        121
#define TRISC7                        122
#define PIE1                          123
#define TMR1IE                        124
#define TXIE                          125
#define RCIE                          126
#define ADIE                          127
#define TMR1GIE                       128
#define PIE2                          129
#define LCDIE                         130
#define OPTION_REG                    131
#define PS                            132
#define PS0                           133
#define PS1                           134
#define PS2                           135
#define PSA                           136
#define T0SE                          137
#define TMR0SE                        138
#define T0CS                          139
#define TMR0CS                        140
#define INTEDG                        141
#define nWPUEN                        142
#define PCON                          143
#define nBOR                          144
#define nPOR                          145
#define nRI                           146
#define nRMCLR                        147
#define nRWDT                         148
#define STKUNF                        149
#define STKOVF                        150
#define WDTCON                        151
#define SWDTEN                        152
#define WDTPS                         153
#define WDTPS0                        154
#define WDTPS1                        155
#define WDTPS2                        156
#define WDTPS3                        157
#define WDTPS4                        158
#define OSCCON                        159
#define SCS0                          160
#define SCS                           161
#define SCS1                          162
#define IRCF                          163
#define IRCF0                         164
#define IRCF1                         165
#define IRCF2                         166
#define IRCF3                         167
#define OSCSTAT                       168
#define HFIOFS                        169
#define LFIOFR                        170
#define HFIOFR                        171
#define OSTS                          172
#define T1OSCR                        173
#define ADRESL                        174
#define ADRESH                        175
#define ADCON0                        176
#define ADON                          177
#define nDONE                         178
#define GO_nDONE                      179
#define GO                            180
#define ADGO                          181
#define CHS0                          182
#define CHS                           183
#define CHS1                          184
#define CHS2                          185
#define CHS3                          186
#define CHS4                          187
#define ADCON1                        188
#define ADPREF0                       189
#define ADPREF                        190
#define ADPREF1                       191
#define ADCS0                         192
#define ADCS                          193
#define ADCS1                         194
#define ADCS2                         195
#define ADFM                          196
#define LATA                          197
#define LATA0                         198
#define LATA1                         199
#define LATA2                         200
#define LATA3                         201
#define LATA4                         202
#define LATA5                         203
#define LATA6                         204
#define LATA7                         205
#define LATB                          206
#define LATB0                         207
#define LATB1                         208
#define LATB2                         209
#define LATB3                         210
#define LATB4                         211
#define LATB5                         212
#define LATB6                         213
#define LATB7                         214
#define LATC                          215
#define LATC0                         216
#define LATC1                         217
#define LATC2                         218
#define LATC3                         219
#define LATC4                         220
#define LATC5                         221
#define LATC6                         222
#define LATC7                         223
#define BORCON                        224
#define BORRDY                        225
#define BORFS                         226
#define SBOREN                        227
#define FVRCON                        228
#define ADFVR0                        229
#define ADFVR                         230
#define ADFVR1                        231
#define CDAFVR                        232
#define TSRNG                         233
#define TSEN                          234
#define FVRRDY                        235
#define FVREN                         236
#define ANSA0                         237
#define ANSELA                        238
#define ANSA1                         239
#define ANSA2                         240
#define ANSA3                         241
#define ANSA5                         242
#define ANSB0                         243
#define ANSELB                        244
#define ANSB1                         245
#define ANSB2                         246
#define ANSB3                         247
#define ANSB4                         248
#define ANSB5                         249
#define PMADRL                        250
#define PMADRH                        251
#define PMDATL                        252
#define PMDATH                        253
#define PMCON1                        254
#define RD                            255
#define WR                            256
#define WREN                          257
#define WRERR                         258
#define FREE                          259
#define LWLO                          260
#define CFGS                          261
#define PMCON2                        262
#define RC1REG                        263
#define TX1REG                        264
#define SP1BRGL                       265
#define BRG0                          266
#define BRG1                          267
#define BRG2                          268
#define BRG3                          269
#define BRG4                          270
#define BRG5                          271
#define BRG6                          272
#define BRG7                          273
#define SP1BRGH                       274
#define BRG8                          275
#define BRG9                          276
#define BRG10                         277
#define BRG11                         278
#define BRG12                         279
#define BRG13                         280
#define BRG14                         281
#define BRG15                         282
#define RC1STA                        283
#define RX9D                          284
#define OERR                          285
#define FERR                          286
#define ADDEN                         287
#define CREN                          288
#define SREN                          289
#define RX9                           290
#define SPEN                          291
#define TX1STA                        292
#define TX9D                          293
#define TRMT                          294
#define BRGH                          295
#define SENDB                         296
#define SYNC                          297
#define TXEN                          298
#define TX9                           299
#define CSRC                          300
#define BAUD1CON                      301
#define ABDEN                         302
#define WUE                           303
#define BRG16                         304
#define SCKP                          305
#define RCIDL                         306
#define ABDOVF                        307
#define WPUB0                         308
#define WPUB                          309
#define WPUB1                         310
#define WPUB2                         311
#define WPUB3                         312
#define WPUB4                         313
#define WPUB5                         314
#define WPUB6                         315
#define WPUB7                         316
#define WPUE                          317
#define WPUE3                         318
#define IOCBP                         319
#define IOCBP0                        320
#define IOCBP1                        321
#define IOCBP2                        322
#define IOCBP3                        323
#define IOCBP4                        324
#define IOCBP5                        325
#define IOCBP6                        326
#define IOCBP7                        327
#define IOCBN0                        328
#define IOCBN                         329
#define IOCBN1                        330
#define IOCBN2                        331
#define IOCBN3                        332
#define IOCBN4                        333
#define IOCBN5                        334
#define IOCBN6                        335
#define IOCBN7                        336
#define IOCBF0                        337
#define IOCBF                         338
#define IOCBF1                        339
#define IOCBF2                        340
#define IOCBF3                        341
#define IOCBF4                        342
#define IOCBF5                        343
#define IOCBF6                        344
#define IOCBF7                        345
#define LCDCON                        346
#define LMUX0                         347
#define LMUX                          348
#define LMUX1                         349
#define CS                            350
#define CS0                           351
#define CS1                           352
#define WERR                          353
#define SLPEN                         354
#define LCDEN                         355
#define LCDPS                         356
#define LP                            357
#define LP0                           358
#define LP1                           359
#define LP2                           360
#define LP3                           361
#define WA                            362
#define LCDA                          363
#define BIASMD                        364
#define WFT                           365
#define LCDREF                        366
#define VLCD1PE                       367
#define VLCD2PE                       368
#define VLCD3PE                       369
#define LCDIRI                        370
#define LCDIRE                        371
#define LCDCST0                       372
#define LCDCST                        373
#define LCDCST1                       374
#define LCDCST2                       375
#define LCDRL                         376
#define LRLAT0                        377
#define LRLAT                         378
#define LRLAT1                        379
#define LRLAT2                        380
#define LRLBP                         381
#define LRLBP0                        382
#define LRLBP1                        383
#define LRLAP0                        384
#define LRLAP                         385
#define LRLAP1                        386
#define LCDSE0                        387
#define SE0                           388
#define SE1                           389
#define SE2                           390
#define SE3                           391
#define SE4                           392
#define SE5                           393
#define SE6                           394
#define SE7                           395
#define LCDSE1                        396
#define SE8                           397
#define SE9                           398
#define SE10                          399
#define SE11                          400
#define SE12                          401
#define SE13                          402
#define SE14                          403
#define SE15                          404
#define LCDSE3                        405
#define SE24                          406
#define SE25                          407
#define SE26                          408
#define LCDDATA0                      409
#define SEG0COM0                      410
#define SEG1COM0                      411
#define SEG2COM0                      412
#define SEG3COM0                      413
#define SEG4COM0                      414
#define SEG5COM0                      415
#define SEG6COM0                      416
#define SEG7COM0                      417
#define LCDDATA1                      418
#define SEG8COM0                      419
#define SEG9COM0                      420
#define SEG10COM0                     421
#define SEG11COM0                     422
#define SEG12COM0                     423
#define SEG13COM0                     424
#define SEG14COM0                     425
#define SEG15COM0                     426
#define LCDDATA3                      427
#define SEG0COM1                      428
#define SEG1COM1                      429
#define SEG2COM1                      430
#define SEG3COM1                      431
#define SEG4COM1                      432
#define SEG5COM1                      433
#define SEG6COM1                      434
#define SEG7COM1                      435
#define LCDDATA4                      436
#define SEG8COM1                      437
#define SEG9COM1                      438
#define SEG10COM1                     439
#define SEG11COM1                     440
#define SEG12COM1                     441
#define SEG13COM1                     442
#define SEG14COM1                     443
#define SEG15COM1                     444
#define LCDDATA6                      445
#define SEG0COM2                      446
#define SEG1COM2                      447
#define SEG2COM2                      448
#define SEG3COM2                      449
#define SEG4COM2                      450
#define SEG5COM2                      451
#define SEG6COM2                      452
#define SEG7COM2                      453
#define LCDDATA7                      454
#define SEG8COM2                      455
#define SEG9COM2                      456
#define SEG10COM2                     457
#define SEG11COM2                     458
#define SEG12COM2                     459
#define SEG13COM2                     460
#define SEG14COM2                     461
#define SEG15COM2                     462
#define LCDDATA9                      463
#define SEG0COM3                      464
#define SEG1COM3                      465
#define SEG2COM3                      466
#define SEG3COM3                      467
#define SEG4COM3                      468
#define SEG5COM3                      469
#define SEG6COM3                      470
#define SEG7COM3                      471
#define LCDDATA10                     472
#define SEG8COM3                      473
#define SEG9COM3                      474
#define SEG10COM3                     475
#define SEG11COM3                     476
#define SEG12COM3                     477
#define SEG13COM3                     478
#define SEG14COM3                     479
#define SEG15COM3                     480
#define LCDDATA12                     481
#define SEG24COM0                     482
#define SEG25COM0                     483
#define SEG26COM0                     484
#define LCDDATA15                     485
#define SEG24COM1                     486
#define SEG25COM1                     487
#define SEG26COM1                     488
#define LCDDATA18                     489
#define SEG24COM2                     490
#define SEG25COM2                     491
#define SEG26COM2                     492
#define LCDDATA21                     493
#define SEG24COM3                     494
#define SEG25COM3                     495
#define SEG26COM3                     496
#define STATUS_SHAD                   497
#define C_SHAD                        498
#define DC_SHAD                       499
#define Z_SHAD                        500
#define WREG_SHAD                     501
#define BSR_SHAD                      502
#define PCLATH_SHAD                   503
#define FSR0L_SHAD                    504
#define FSR0H_SHAD                    505
#define FSR1L_SHAD                    506
#define FSR1H_SHAD                    507
#define STKPTR                        508
#define TOSL                          509
#define TOSH                          510

#endif // _PIC16LF1906_H_
